#hello world

In [2]:
from IPython.display import IFrame 
agelink="https://www.cia.gov/the-world-factbook/field/median-age/country-comparison"
IFrame(agelink, width=900, height=500)

In [15]:
import pandas as pd
agetable=pd.read_html(agelink, header=0, flavor='bs4')
agetable[0].head()

   Rank                    Country  years Date of Information
0     1                     Monaco   55.4                 NaN
1     2                      Japan   48.6                 NaN
2     3  Saint Pierre and Miquelon   48.5                 NaN
3     4                    Germany   47.8                 NaN
4     5                      Italy   46.5                 NaN

In [5]:
agetable

[     Rank                    Country  years Date of Information
 0       1                     Monaco   55.4                 NaN
 1       2                      Japan   48.6                 NaN
 2       3  Saint Pierre and Miquelon   48.5                 NaN
 3       4                    Germany   47.8                 NaN
 4       5                      Italy   46.5                 NaN
 ..    ...                        ...    ...                 ...
 222   223                       Chad   16.1                 NaN
 223   224                       Mali   16.0                 NaN
 224   225                     Angola   15.9                 NaN
 225   226                     Uganda   15.7                 NaN
 226   227                      Niger   14.8                 NaN

 [227 rows x 4 columns]]

In [21]:
DFage=agetable[0].copy()

In [22]:
DFage.columns

Index(['Rank', 'Country', 'years', 'Date of Information'], dtype='object')

In [23]:
bye=[3]
DFage.drop(columns=DFage.columns[bye],inplace=True)
DFage

     Rank                    Country  years
0       1                     Monaco   55.4
1       2                      Japan   48.6
2       3  Saint Pierre and Miquelon   48.5
3       4                    Germany   47.8
4       5                      Italy   46.5
..    ...                        ...    ...
222   223                       Chad   16.1
223   224                       Mali   16.0
224   225                     Angola   15.9
225   226                     Uganda   15.7
226   227                      Niger   14.8

[227 rows x 3 columns]

In [24]:
DFage.columns.to_list()

['Rank', 'Country', 'years']

In [27]:
DFage.columns.str.replace(pat="\W",repl="",regex=True)

Index(['Rank', 'Country', 'years'], dtype='object')

In [28]:
DFage.columns.str.replace("\W","",regex=True).to_list()

['Rank', 'Country', 'years']

In [29]:
DFage.columns=DFage.columns.str.replace("\W","",regex=True).to_list()

In [30]:
DFage.iloc[:,:2]

     Rank                    Country
0       1                     Monaco
1       2                      Japan
2       3  Saint Pierre and Miquelon
3       4                    Germany
4       5                      Italy
..    ...                        ...
222   223                       Chad
223   224                       Mali
224   225                     Angola
225   226                     Uganda
226   227                      Niger

[227 rows x 2 columns]

In [34]:
DFage.Country.str.strip()

0                         Monaco
1                          Japan
2      Saint Pierre and Miquelon
3                        Germany
4                          Italy
                 ...
222                         Chad
223                         Mali
224                       Angola
225                       Uganda
226                        Niger
Name: Country, Length: 227, dtype: object

In [37]:
DFage.columns.str.capitalize()

Index(['Rank', 'Country', 'Years'], dtype='object')

In [105]:
DFage.to_csv("Medianage.csv",index=False)

In [106]:
Agecsv=pd.read_csv('Medianage.csv')

Agecsv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227 entries, 0 to 226
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     227 non-null    int64
 1   Country  227 non-null    object
 2   Years    227 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 5.4+ KB

In [77]:
from IPython.display import IFrame  
obelink="https://www.cia.gov/the-world-factbook/field/obesity-adult-prevalence-rate/country-comparison" 
IFrame(obelink, width=900, height=500)

In [78]:
import pandas as pd

Obetable=pd.read_html(obelink, 
                        header=0, 
                        flavor='bs4')

In [80]:
Obetable[0]

     Rank           Country     %  Date of Information
0       1             Nauru  61.0                 2016
1       2      Cook Islands  55.9                 2016
2       3             Palau  55.3                 2016
3       4  Marshall Islands  52.9                 2016
4       5            Tuvalu  51.6                 2016
..    ...               ...   ...                  ...
187   188          Cambodia   3.9                 2016
188   189             India   3.9                 2016
189   190       Timor-Leste   3.8                 2016
190   191        Bangladesh   3.6                 2016
191   192           Vietnam   2.1                 2016

[192 rows x 4 columns]

In [81]:
DFobe=Obetable[0].copy()

In [82]:
DFobe.columns

Index(['Rank', 'Country', '%', 'Date of Information'], dtype='object')

In [83]:
bye=[3]
DFobe.drop(columns=DFobe.columns[bye],inplace=True)
DFobe

     Rank           Country     %
0       1             Nauru  61.0
1       2      Cook Islands  55.9
2       3             Palau  55.3
3       4  Marshall Islands  52.9
4       5            Tuvalu  51.6
..    ...               ...   ...
187   188          Cambodia   3.9
188   189             India   3.9
189   190       Timor-Leste   3.8
190   191        Bangladesh   3.6
191   192           Vietnam   2.1

[192 rows x 3 columns]

In [88]:
DFobe.columns.to_list()

['Rank', 'Country', '%']

In [89]:
DFobe.columns.str.replace(pat="%",
                           repl="Percent of Obesity", 
                           regex=True)

Index(['Rank', 'Country', 'Percent of Obesity'], dtype='object')

In [90]:
DFobe.columns.str.replace("%","Percent of Obesity",regex=True).to_list()

['Rank', 'Country', 'Percent of Obesity']

In [91]:
DFobe.columns=DFobe.columns.str.replace("%","Percent of Obesity",regex=True).to_list()

In [93]:
DFobe.iloc[:,:3]

     Rank           Country  Percent of Obesity
0       1             Nauru                61.0
1       2      Cook Islands                55.9
2       3             Palau                55.3
3       4  Marshall Islands                52.9
4       5            Tuvalu                51.6
..    ...               ...                 ...
187   188          Cambodia                 3.9
188   189             India                 3.9
189   190       Timor-Leste                 3.8
190   191        Bangladesh                 3.6
191   192           Vietnam                 2.1

[192 rows x 3 columns]

In [84]:
DFobe.Country.str.strip()

0                 Nauru
1          Cook Islands
2                 Palau
3      Marshall Islands
4                Tuvalu
             ...
187            Cambodia
188               India
189         Timor-Leste
190          Bangladesh
191             Vietnam
Name: Country, Length: 192, dtype: object

In [100]:
DFobe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 192 entries, 0 to 191
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                192 non-null    int64
 1   Country             192 non-null    object
 2   Percent of Obesity  192 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.6+ KB

In [101]:
DFobe.to_csv("obesity.csv",index=False)

In [102]:
Obesitycsv=pd.read_csv('obesity.csv')

In [103]:
Obesitycsv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 192 entries, 0 to 191
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                192 non-null    int64
 1   Country             192 non-null    object
 2   Percent of Obesity  192 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.6+ KB

In [107]:
from IPython.display import IFrame  
alclink="https://www.cia.gov/the-world-factbook/field/alcohol-consumption-per-capita/country-comparison" 
IFrame(alclink, width=900, height=500)

In [108]:
import pandas as pd

Alctable=pd.read_html(alclink, 
                        header=0, 
                        flavor='bs4')

In [110]:
Alctable[0]

     Rank       Country  liters of pure alcohol Date of Information
0       1  Cook Islands                   12.97           2019 est.
1       2        Latvia                   12.90           2019 est.
2       3       Czechia                   12.73           2019 est.
3       4     Lithuania                   11.93           2019 est.
4       5       Austria                   11.90           2019 est.
..    ...           ...                     ...                 ...
184   185    Bangladesh                    0.00           2019 est.
185   186        Kuwait                    0.00           2019 est.
186   187    Mauritania                    0.00           2019 est.
187   188  Saudi Arabia                    0.00           2019 est.
188   189       Somalia                    0.00           2019 est.

[189 rows x 4 columns]

In [111]:
DFalc=Alctable[0].copy()

In [112]:
DFalc.columns

Index(['Rank', 'Country', 'liters of pure alcohol', 'Date of Information'], dtype='object')

In [113]:
bye=[3]
DFalc.drop(columns=DFalc.columns[bye],inplace=True)
DFalc

     Rank       Country  liters of pure alcohol
0       1  Cook Islands                   12.97
1       2        Latvia                   12.90
2       3       Czechia                   12.73
3       4     Lithuania                   11.93
4       5       Austria                   11.90
..    ...           ...                     ...
184   185    Bangladesh                    0.00
185   186        Kuwait                    0.00
186   187    Mauritania                    0.00
187   188  Saudi Arabia                    0.00
188   189       Somalia                    0.00

[189 rows x 3 columns]

In [114]:
DFalc.columns.to_list()

['Rank', 'Country', 'liters of pure alcohol']

In [117]:
DFalc.Country.str.strip()

0      Cook Islands
1            Latvia
2           Czechia
3         Lithuania
4           Austria
           ...
184      Bangladesh
185          Kuwait
186      Mauritania
187    Saudi Arabia
188         Somalia
Name: Country, Length: 189, dtype: object

In [129]:
DFalc.columns

Index(['Rank', 'Country', 'liters of pure alcohol'], dtype='object')

In [134]:
DFalc.columns.str.capitalize()

Index(['Rank', 'Country', 'Liters of pure alcohol'], dtype='object')

In [136]:
DFalc.to_csv("Alcohol.csv",index=False)

In [137]:
Alccsv=pd.read_csv('Alcohol.csv')

In [138]:
DFalc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 189 entries, 0 to 188
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    189 non-null    int64
 1   Country                 189 non-null    object
 2   liters of pure alcohol  189 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.6+ KB

In [139]:
from IPython.display import IFrame  
tbclink="https://www.cia.gov/the-world-factbook/field/tobacco-use/country-comparison" 
IFrame(tbclink, width=900, height=500)

In [140]:
import pandas as pd

Tbctable=pd.read_html(tbclink, 
                        header=0, 
                        flavor='bs4',)

In [141]:
Tbctable[0]

     Rank           Country     % Date of Information
0       1             Nauru  48.5           2020 est.
1       2             Burma  44.1           2020 est.
2       3          Kiribati  40.6           2020 est.
3       4            Serbia  39.8           2020 est.
4       5  Papua New Guinea  39.3           2020 est.
..    ...               ...   ...                 ...
159   160      Turkmenistan   5.5           2020 est.
160   161          Ethiopia   5.1           2020 est.
161   162            Panama   5.0           2020 est.
162   163           Nigeria   3.7           2020 est.
163   164             Ghana   3.5           2020 est.

[164 rows x 4 columns]

In [142]:
DFtbc=Tbctable[0].copy()

In [143]:
DFtbc.columns

Index(['Rank', 'Country', '%', 'Date of Information'], dtype='object')

In [144]:
bye=[3]
DFtbc.drop(columns=DFtbc.columns[bye],inplace=True)
DFtbc

     Rank           Country     %
0       1             Nauru  48.5
1       2             Burma  44.1
2       3          Kiribati  40.6
3       4            Serbia  39.8
4       5  Papua New Guinea  39.3
..    ...               ...   ...
159   160      Turkmenistan   5.5
160   161          Ethiopia   5.1
161   162            Panama   5.0
162   163           Nigeria   3.7
163   164             Ghana   3.5

[164 rows x 3 columns]

In [146]:
DFtbc.columns.str.replace(pat="%",
                           repl="Percent of Tobacco Use", 
                           regex=True)

Index(['Rank', 'Country', 'Percent of Tobacco Use'], dtype='object')

In [147]:
DFtbc.columns.str.replace("%","Percent of Tobacco Use",regex=True).to_list()

['Rank', 'Country', 'Percent of Tobacco Use']

In [148]:
DFtbc.columns=DFtbc.columns.str.replace("%","Percent of Tobacco Use",regex=True).to_list()

In [151]:
DFtbc.iloc[:,:3]

     Rank           Country  Percent of Tobacco Use
0       1             Nauru                    48.5
1       2             Burma                    44.1
2       3          Kiribati                    40.6
3       4            Serbia                    39.8
4       5  Papua New Guinea                    39.3
..    ...               ...                     ...
159   160      Turkmenistan                     5.5
160   161          Ethiopia                     5.1
161   162            Panama                     5.0
162   163           Nigeria                     3.7
163   164             Ghana                     3.5

[164 rows x 3 columns]

In [152]:
DFtbc.Country.str.strip()

0                 Nauru
1                 Burma
2              Kiribati
3                Serbia
4      Papua New Guinea
             ...
159        Turkmenistan
160            Ethiopia
161              Panama
162             Nigeria
163               Ghana
Name: Country, Length: 164, dtype: object

In [158]:
DFtbc.to_csv("Tobacco.csv",index=False)

In [159]:
tobaccocsv=pd.read_csv('Tobacco.csv')

In [160]:
tobaccocsv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 164 entries, 0 to 163
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    164 non-null    int64
 1   Country                 164 non-null    object
 2   Percent of Tobacco Use  164 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.0+ KB